print("     Лабораторна робота №3. Змінні. Базові операції вводу/виводу")
print("Мета: освоїти роботу зі змінними та операції вводу і виводу.")
print(" ")
print("     Завдання №1")
print("Написати програму, яка обчислює значення функції Гауса:")
σ = 1
e = 1
x = 1
μ = 1
f = (1 / σ * (2 * 3.14 ** 0.5)) * (e ** (-(x - μ) ** 2) / (2 * σ) ** 2)
print("f(x) =", f)
print(" ")
print("     Завдання №2")
print("Якось Джон мав три яблука, Мері мала п’ять яблук, а Адам мав шість яблук. Усі вони були дуже щасливі та жили довго. Кінець історії.")
adam = 6
mary = 5
john = 3
totall = adam + mary + john
print("totalapples = ", totall)
print(" ")
print("     Завдання № 3")
print("Милі та кілометри – це одиниці довжини або відстані.")
print("Враховуючи, що 1 миля дорівнює приблизно 1.61 кілометрам, напишіть програму, щоб вона перетворила:")
print("     -милі у кілометри;")
print("     -кілометри на милі.")
km = 1000
ml = 1610
x = 8
y = 12
km_to_ml = ((100 / 1000) * (100 / 1610)) * (x * 100)
ml_to_km = ((100 / 1610) * (100 / 1000)) * (y * 100)
print("8 кілометрів це -", km_to_ml, "миль")
print("12 миль це -", ml_to_km, "кілометрів")
print(" ")
print("     Завдання №4")
print("Завершити код, щоб оцінити вираз.")
x = 0
x = float(x)
y = ((3 * x) ** 3) - ((2 * x) ** 2) + (3 ** x) - 1
print("y =", y)
x = 2
x = float(x)
y = ((3 * x) ** 3) - ((2 * x) ** 2) + (3 ** x) - 1
print("y =", y)
x = 1
x = float(x)
y = ((3 * x) ** 3) - ((2 * x) ** 2) + (3 ** x) - 1
print("y =", y)
print(" ")
print("     Завдання №5")
print("Код редактора містить коментарі.")
print("Спробуйте покращити його: додайте або видаліть коментарі там, де ви вважаєте це доречним.")
print(" ")
a = 2
seconds = 3600
print("Hours: ", a)
# без водички.
print(" ")
print("     Завдання №6")
print("Ваше завдання – завершити код, щоб отримати результати чотирьох основних арифметичних операцій.")
x = float(input("Enter value for x: "))
y = 1 / (x + 1 / (x + 1 / (x + 1 / (x + 1))))
print("y =", y)
print(" ")
print("     Завдання №8")
print("Ваше завдання - підготувати простий код, здатний порахувати час закінчення періоду часу, вираженого в кількості хвилин.")
hour = int(input("Starting time (hours): "))
mins = int(input("Starting time (minutes): "))
dura = int(input("Event duration (minutes): "))
end = mins + dura
x = end
y = end - 60
if x > 59:
    print(hour + 1, ":", y)
elif x < 59:
    print(hour, ":", end)
print(" ")
print("     Контрольні запитання")
print("(1) - 10")
print("(2) - 2")
print("Висновок: освоїв роботу зі змінними та операції вводу, виводу.")
print("Виконав Ковалевський О.В. Е-22-1с")