print("""
    Лабораторна робота №7
Мета: навчитися працювати зі структурами даних Кортеж та Словник. Навчитись обробляти основні типи винятків.

""")

print("     Завдання 1")
print("""

    Напишіть програму, яка створює кортеж зі списку чисел, а потім виводить на екран всі числа, які менші за задане число n.
Умова: користувач вводить число n, і щоб створити новий список result, який містить всі числа з кортежу, які менші за n,
реалізувати за допомогою генератора списків.
""")
print("result")
crtg = [1, 2, 3, 4, 5, 6, 7, 8, 9]
a = 5
for numbers in crtg:
    if numbers > a:
        print(numbers, end = " ")
print("""
""")


print("     Завдання 2")
print("""

Напишіть програму, яка створює кортеж з трьох елементів, які є рядками, та з’єднує їх в один рядок з комою як роздільником.
""")
a = "Зелене"
b = "дерево"
c = "на вулиці."
d = [a, b, c]

print(d)
print(" ")

print("     Завдання 3")
print("""
    Створіть словник, який містить інформацію про книги в бібліотеці. Ключами будуть назви книг, а значеннями - автори,
рік видання та кількість сторінок. Виведіть на екран інформацію про книгу, введену користувачем.
""")
print("Всього три книги 1, 2, 3.")
Book_1 = "автор - 1, рік видання - 2000, кількість сторінок - 444"
Book_2 = "автор - 2, рік видання - 1212, кількість сторінок - 432"
Book_3 = "автор - 3, рік видання - 2012130, кількість сторінок - 442134"
a = input("Оберіть книгу - ")
if a == "1":
    print(Book_1)
if a == "2":
    print(Book_2)
if a == "3":
    print(Book_3)
print(" ")


print("     Завдання 4")
print("""
    Напишіть програму, яка створює словник, що містить інформацію про студентів, використовуючи вказані кортежі в якості значень.
Кожен ключ – це прізвище студента. Виведіть на екран інформацію про студента, введеного користувачем.
""")